Autodesk.Revit.DB.Architecture.TopographyLinkType.GetTopographyLinkPath
Gets the TopographyLinkType path
Returns:
The path for the Topography Link.
Since:
2019

Autodesk.Revit.DB.Architecture.TopographyLinkType.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.Architecture.ToposurfaceData})
Creates a new Topography link type.
document:
The document in which to create the Topography Link.
path:
The path of the link file.
surfacesData:
THe surface data in the link file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019

Autodesk.Revit.DB.Architecture.TopographyLinkType
This class represents the site file brought into the current Revit document.
Since:
2019